package org.reempreende.presentation.view.cliente;

import org.reempreende.presentation.interfaces.icliente.IClienteView;

import java.util.OptionalInt;

public class ClienteView implements IClienteView {
    @Override
    public OptionalInt mostrarTela() {
        System.out.println("            ███████╗ ██╗     ██╗███████╗███╗   ██ ████████╗███████╗");
        System.out.println("            ██╔════╝ ██║     ██║██╔════╝████╗  ██║╚══██╔══╝██╔════╝");
        System.out.println("            ██║      ██║     ██║█████╗  ██╔██╗ ██║   ██║   █████╗ ");
        System.out.println("            ██║      ██║     ██║██╔══╝  ██║╚██╗██║   ██║   ██╔══╝  ");
        System.out.println("            ███████╗ ███████╗██║███████╗██║ ╚████║   ██║   ███████╗");
        System.out.println("            ╚══════╝ ╚══════╝╚═╝╚══════╝╚═╝  ╚═══╝   ╚═╝   ╚══════╝");

        return OptionalInt.empty();
    }
}
